WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Drivers/Ext_Board/inc/stm32f4xx_nucleo_ExtRC522.h
/**
  ******************************************************************************
  * @file    stm32f4xx_nucleo_ExtRC522.h
  * @author  '^_^'
  * @version V0.0.0
  * @date    9-October-2014
  * @brief   This file contains all the functions prototypes for the
  *            stm32f4xx_nucleo_ExtRC522.c firmware driver.
  ******************************************************************************  
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4XX_NUCLEO_EXTRC522_H
#define __STM32F4XX_NUCLEO_EXTRC522_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

//#define USE_IRQ_PIN
#define USE_DEFAULT_TIMEOUT_CALLBACK
#define MFRC522_FLAG_TIMEOUT			((uint32_t)0x1000)
#define COMMUNI_WAIT_TIME				((uint16_t)10000)
#define CAL_CRC_WAIT_TIME				((uint16_t)1000)
#define MAX_LEN							18
	 
/* Exported macro ------------------------------------------------------------*/

/**
  * @brief MFRC522 Struct
  */
typedef struct
{
	uint8_t TAutoMode;
	uint16_t TPrescaler;
	uint16_t TReload;
	uint8_t ASKRequi;
	uint8_t CRCPreset;
}MFRC522_InitTypeDef;

/**
  * @brief  MFRC522 SPI Interface pins
  */
#define MFRC522_SPI								SPI3
#define MFRC522_SPI_CLK_ENABLE()              __SPI3_CLK_ENABLE()

#define MFRC522_SPI_SCK_PIN						GPIO_PIN_10
#define MFRC522_SPI_SCK_GPIO_PORT				GPIOC
#define MFRC522_SPI_SCK_AF						GPIO_AF6_SPI3
#define MFRC522_SPI_SCK_GPIO_CLK_ENABLE()     __GPIOC_CLK_ENABLE()
#define MFRC522_SPI_SCK_GPIO_CLK_DISABLE()    __GPIOC_CLK_DISABLE()

#define MFRC522_SPI_MISO_PIN                    GPIO_PIN_11
#define MFRC522_SPI_MISO_GPIO_PORT				GPIOC
#define MFRC522_SPI_MISO_AF						GPIO_AF6_SPI3
#define MFRC522_SPI_MISO_GPIO_CLK_ENABLE()    __GPIOC_CLK_ENABLE()
#define MFRC522_SPI_MISO_GPIO_CLK_DISABLE()   __GPIOC_CLK_DISABLE()

#define MFRC522_SPI_MOSI_PIN                    GPIO_PIN_12
#define MFRC522_SPI_MOSI_GPIO_PORT				GPIOC
#define MFRC522_SPI_MOSI_AF						GPIO_AF6_SPI3
#define MFRC522_SPI_MOSI_GPIO_CLK_ENABLE()    __GPIOC_CLK_ENABLE()
#define MFRC522_SPI_MOSI_GPIO_CLK_DISABLE()   __GPIOC_CLK_DISABLE()

#define MFRC522_SPI_RST_PIN                     GPIO_PIN_4
#define MFRC522_SPI_RST_GPIO_PORT               GPIOA
#define MFRC522_SPI_RST_GPIO_CLK_ENABLE()     __GPIOA_CLK_ENABLE()
#define MFRC522_SPI_RST_GPIO_CLK_DISABLE()    __GPIOA_CLK_DISABLE()

#define MFRC522_SPI_NSS_PIN                     GPIO_PIN_0
#define MFRC522_SPI_NSS_GPIO_PORT               GPIOB
#define MFRC522_SPI_NSS_GPIO_CLK_ENABLE()     __GPIOB_CLK_ENABLE()
#define MFRC522_SPI_NSS_GPIO_CLK_DISABLE()    __GPIOB_CLK_DISABLE()

#define MFRC522_RST_HIGH()		HAL_GPIO_WritePin(MFRC522_SPI_RST_GPIO_PORT, MFRC522_SPI_RST_PIN, GPIO_PIN_SET);
#define MFRC522_RST_LOW()		HAL_GPIO_WritePin(MFRC522_SPI_RST_GPIO_PORT, MFRC522_SPI_RST_PIN, GPIO_PIN_RESET);

#define MFRC522_NSS_HIGH()		HAL_GPIO_WritePin(MFRC522_SPI_NSS_GPIO_PORT, MFRC522_SPI_NSS_PIN, GPIO_PIN_SET);
#define MFRC522_NSS_LOW()		HAL_GPIO_WritePin(MFRC522_SPI_NSS_GPIO_PORT, MFRC522_SPI_NSS_PIN, GPIO_PIN_RESET);

#ifdef USE_IRQ_PIN

#define MFRC522_SPI_IRQ_PIN                     GPIO_PIN_5
#define MFRC522_SPI_IRQ_GPIO_PORT               GPIOA
#define MFRC522_SPI_IRQ_GPIO_CLK_ENABLE()     __GPIOA_CLK_ENABLE()
#define MFRC522_SPI_IRQ_GPIO_CLK_DISABLE()    __GPIOA_CLK_DISBALE()

#endif

/******************************** Error Code *********************************/
#define MI_OK								0x00
#define MI_NOTAGREE							0x01
#define MI_ERROR							0x02

/**************************** Mifare Card Command ****************************/
#define PICC_REQIDL							0x26
#define PICC_REQALL							0x52
#define PICC_ANTICOLL1						0x93
#define PICC_ANTICOLL2						0x95
#define PICC_AUTHENT1A						0x60
#define PICC_AUTHENT1B						0x61
#define PICC_READ							0x30
#define PICC_WRITE							0xA0
#define PICC_DECREMENT						0xC0
#define PICC_INCREMENT						0xC1
#define PICC_RESTORE						0xC2
#define PICC_TRANSFER						0xB0
#define PICC_HALT							0x50

/*************************** SPI(MFRC522) commands ***************************/
/**
  * @brief
  * No action; cancels current command execution.
  */
#define IDLE								0x00
/**
  * @brief
  * Stores 25 byte into the internal buffer.
  */
#define MEM									0x01
/**
  * @brief
  * Generates a 10 byte random ID number.
  */
#define GenerateRandomID					0x02
/**
  * @brief
  * Activates the CRC co-processor or performs a selftest.
  */
#define CalcCRC								0x03
/**
  * @brief
  * Transmits data from the FIFO buffer.
  */
#define TRANSMIT							0x04
/**
  * @brief
  * No command change. this command can be used to modify different bits in the command
  * register without touching the command. E.g. Power-down.
  */
#define NoCmdChange							0x07
/**
  * @brief
  * Activates the receiver circuitry.
  */
#define RECEIVER							0x08
/**
  * @brief
  * Transmits data from FIFO buffer to the antenna and activates automatically the receiver
  * after transmission.
  */
#define Transceive							0x0c
/**
  * @brief
  * Reserved for further use. ^Useless^
  */
#define RESERVED							0x0d
/**
  * @brief
  * Performs the MIFARE(R) standard authentication as a reader.
  */
#define MFAuthent							0x0e
/**
  * @brief
  * Resets the MFRC522.
  */
#define SoftReset							0x0f
/* MFRC522 Command Description (In the 73 page) */

/*******************************************************************************/
/********************** SPI(MFRC522) registers(addresses) **********************/
/*******************************************************************************/

/*------------------------ Page0 : Command and Status -------------------------*/
/* Reserved for future use ----------------------------------------------------*/
#define RFU00								0x00
/* Starts and stops command execution -----------------------------------------*/
#define CommandReg							0x01
/*
								Description of CommandReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|7 to 6	|    -     |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|	5	|  RcvOff  |Set to logic 1, the analog part of the receiver is switched off.		|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, Soft Power-down mode is entered.						|
|		|		   |Set to logic 0, the MFRC522 starts the wake up procedure. During this	|
|	4	|PowerDown |procedure this bit still shows a logic 1. A logic 0 indicates that the	|
|		|		   |MFRC522 is ready for operations; see Section 16.2 Soft "Power-down".	|
|		|		   |Remark: The bit PowerDown cannot be set, when the command SoftReset		|
|		|		   |		has been activated.												|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Activates a command according to the Command Code. Reading this	register|
|3 to 0	| Command  |shows which command is actually executed (see Section 18.3 "MFRC522		|
|		|		   |Commands Overview").													|
+-------+----------+------------------------------------------------------------------------+
*/
/* Control bits to enable and disable the passing of interrupt requests -------*/
#define CommIEnReg							0x02
/*
								Description of CommIEnReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, the signal on pin IRQ is inverted with respect to bit	|
|		|		   |IRq in the register Status1Reg.											|
|	7	|  IRqInv  |Set to logic 0, the signal on pin IRQ is equal to bit IRq. In			|
|		|		   |combination with bit IRqPushPull in register DivIEnReg, the default		|
|		|		   |value of logic 1 ensures, that the output level on pin IRQ is tristate.	|
+-------+----------+------------------------------------------------------------------------+
|	6	|  TxIEn   |Allows the transmitter interrupt request (indicated by bit TxIRq) to be	|
|		|		   |propagated to pin IRQ.													|
+-------+----------+------------------------------------------------------------------------+
|	5	|  RxIEn   |Allows the receiver interrupt request (indicated by bit RxIRq) to be	|
|		|		   |propagated to pin IRQ.													|
+-------+----------+------------------------------------------------------------------------+
|	4	| IdleIEn  |Allows the idle interrupt request (indicated by bit IdleIRq) to be		|
|		|		   |propagated to pin IRQ.													|
+-------+----------+------------------------------------------------------------------------+
|	3	|HiAlertIEn|Allows the high alert interrupt request (indicated by bit HiAlertIRq)	|
|		|		   |to be propagated to pin IRQ.											|
+-------+----------+------------------------------------------------------------------------+
|	2	|LoAlertIEn|Allows the low alert interrupt request (indicated by bit LoAlertIRq)	|
|		|		   |to be propagated to pin IRQ.											|
+-------+----------+------------------------------------------------------------------------+
|	1	|  ErrIEn  |Allows the error interrupt request (indicated by bit ErrIRq) to be		|
|		|		   |propagated to pin IRQ.													|
+-------+----------+------------------------------------------------------------------------+
|	0	| TimerIEn |Allows the timer interrupt request (indicated by bit TimerIRq) to be	|
|		|		   |propagated to pin IRQ.													|
+-------+----------+------------------------------------------------------------------------+
*/
/* Control bits to enable and disable the passing of interrupt requests -------*/
#define DivIEnReg							0x03
/*
								 Description of DivIEnReg bits
+-------+-----------+------------------------------------------------------------------------+
|  Bit  |  Symbol   |								Description								 |
+-------+-----------+------------------------------------------------------------------------+
|	7	|IRQPushPull|Set to logic 1, the pin IRQ works as standard CMOS output pad.			 |
|		|			|Set to logic 0, the pin IRQ works as open drain output pad.			 |
+-------+-----------+------------------------------------------------------------------------+
|6 to 5	|	  -  	|Reserved for future use.												 |
+-------+-----------+------------------------------------------------------------------------+
|	4	|MfinActIEn	|Allows the MFIN active interrupt request to be propagated to pin IRQ.	 |
+-------+-----------+------------------------------------------------------------------------+
|	3	|	  -  	|Reserved for future use.												 |
+-------+-----------+------------------------------------------------------------------------+
|	2	|	CRCIEn	|Allows the CRC interrupt request (indicated by bit CRCIRq) to be		 |
|		|			|propagated to pin IRQ.													 |
+-------+-----------+------------------------------------------------------------------------+
|1 to 0	|	  -  	|Reserved for future use.												 |
+-------+-----------+------------------------------------------------------------------------+
*/
/* Contains Interrupt Request bits --------------------------------------------*/
#define CommIRqReg							0x04
/*
								Description of CommIRqReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, Set1 defines that the marked bits in the register		|
|	7	|	Set1   |CommIRqReg are set.														|
|		|		   |Set to logic 0, Set1 defines, that the marked bits in the register		|
|		|		   |CommIRqReg are cleared.													|
+-------+----------+------------------------------------------------------------------------+
|	6	|	TxIRq  |Set to logic 1 immediately after the last bit of the transmitted data	|
|		|		   |was sent out.															|
+-------+----------+------------------------------------------------------------------------+
|		|	RxIRq  |Set to logic 1 when the receiver detects the end of a valid data stream.|
|	5	|		   |If the bit RxNoErr in register RxModeReg is set to logic 1, Bit RxIRq	|
|		|		   |is only set to logic 1 when data bytes are available in the FIFO.		|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, when a command terminates by itself e.g. when the		|
|		|		   |CommandReg changes its value from any command to the Idle Command.		|
|	4	|  IdleIRq |If an unknown command is started, the CommandReg changes its content to	|
|		|		   |the idle state and the bit IdleIRq is set. Starting the Idle Command by	|
|		|		   |the u-Controller does not set bit IdleIRq.								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, when bit HiAlert in register Status1Reg is set. In		|
|	3	|HiAlertIRq|opposition to HiAlert, HiAlertIRq stores this event and can only be		|
|		|		   |reset as indicated by bit Set1.											|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, when bit LoAlert in register Status1Reg is set. In		|
|	2	|LoAlertIRq|opposition to LoAlert, LoAlertIRq stores this event and can only be		|
|		|		   |reset as indicated by bit Set1.											|
+-------+----------+------------------------------------------------------------------------+
|	1	|  ErrIRq  |Set to logic 1 if any error bit in the ErrorReg Register is set.		|
+-------+----------+------------------------------------------------------------------------+
|	0	| TimerIRq |Set to logic 1 when the timer decrements the TimerValue Register to		|
|		|		   |zero.																	|
+-------+----------+------------------------------------------------------------------------+
*/
/* Contains Interrupt Request bits --------------------------------------------*/
#define DivIRqReg							0x05
/*
								Description of DivIRqReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, Set2 defines that the marked bits in the register		|
|	7	|	Set2   |DivIRqReg are set.														|
|		|		   |Set to logic 0, Set2 defines, that the marked bits in the register		|
|		|		   |DivIRqReg are cleared.													|
+-------+----------+------------------------------------------------------------------------+
|6 to 5 |		   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|	4	|MfinActIRq|Set to logic 1, when MFIN is active. This interrupt is set when either a|
|		|		   |rising or falling signal edge is detected.								|
+-------+----------+------------------------------------------------------------------------+
|	3	|	 -     |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|	2	|  CRCIRq  |Set to logic 1, when the CRC command is active and all data are			|
|		|		   |processed.																|
+-------+----------+------------------------------------------------------------------------+
|1 to 0	|	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
*/
/* Error bits showing the error status of the last command executed -----------*/
#define ErrorReg							0x06
/* Contains status bits for communication -------------------------------------*/
#define Status1Reg							0x07
/*
								Description of Status1Reg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|	7	|	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, if the CRC result is zero. For data transmission and	|
|		|		   |reception the bit CRCOk is undefined (use CRCErr in register			|
|	6	|  CRCOk   |ErrorReg). CRCOk indicates the status of the CRC co-processor,			|
|		|		   |during calculation the value changes to logic 0, when the calculation is|
|		|		   |done correctly, the value changes to logic 1.							|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, when the CRC calculation has finished. This bit is only	|
|	5	| CRCReady |valid for the CRC co-processor calculation using the command			|
|		|		   |CalcCRC.																|
+-------+----------+------------------------------------------------------------------------+
|		|		   |This bit shows, if any interrupt source requests attention (with respect|
|	4	|	IRq    |to the setting of the interrupt enable bits, see register  CommIEnReg	|
|		|		   |and DivIEnReg).															|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, if the MFRC522's timer unit is running, e.g. the timer	|
|		|		   |will decrement the TCounterValReg with the next timer clock.			|
|	3	| TRunning |Remark: In the gated mode the bit TRunning is set to logic 1, when		|
|		|		   |		the timer is enabled by the register bits. This bit is not		|
|		|		   |		influenced by the gated signal.									|
+-------+----------+------------------------------------------------------------------------+
|	2	|	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, when the number of bytes stored in the FIFO buffer		|
|		|		   |fulfils the following equation:											|
|	1	| HiAlert  |HiAlert = (64 - FIFOLength  ) ¡Ü WaterLevel								|
|		|		   |Example:																|
|		|		   |	FIFOLength = 60, WaterLevel = 4 ¡ú HiAlert = 1						|
|		|		   |	FIFOLength = 59, WaterLevel = 4 ¡ú HiAlert = 0						|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, when the number of bytes stored in the FIFO buffer		|
|		|		   |fulfils the following equation:											|
|	0	| LoAlert  |LoAlert = FIFOLength ¡Ü WaterLevel										|
|		|		   |Example:																|
|		|		   |	FIFOLength = 4, WaterLevel = 4 ¡ú LoAlert = 1						|
|		|		   |	FIFOLength = 5, WaterLevel = 4 ¡ú LoAlert = 0						|
+-------+----------+------------------------------------------------------------------------+
*/
/* Contains status bits of the receiver and transmitter -----------------------*/
#define Status2Reg							0x08
/*
								Description of Status2Reg bits
+-------+-------------+---------------------------------------------------------------------+
|  Bit  |    Symbol   |								Description								|
+-------+-------------+---------------------------------------------------------------------+
|	7	|TempSensClear|Set to logic 1, this bit clears the temperature error, if the		|
|		|			  |temperature is below the alarm limit of 125 'C.						|
+-------+-------------+---------------------------------------------------------------------+
|		|			  |I2C input filter settings.											|
|	6	| I2CForceHS  |Set to logic 1, the I2C input filter is set to the High-speed mode	|
|		|			  |independent of the I2C protocol.										|
|		|			  |Set to logic 0, the I2C input filter is set to the used I2C protocol.|
+-------+-------------+---------------------------------------------------------------------+
|5 to 4	|	   -	  |Reserved for future use.												|
+-------+-------------+---------------------------------------------------------------------+
|		|			  |This bit indicates that the MIFARE Crypto1 unit is switched on and	|
|		|			  |therefore all data communication with the card is encrypted.			|
|	3	| MFCrypto1On |This bit can only be set to logic 1 by a successful execution of the	|
|		|			  |MFAuthent Command. This bit is only valid in Reader/Writer mode		|
|		|			  |for MIFARE Standard cards. This bit shall be cleared by software.	|
+-------+-------------+---------------------------------------------------------------------+
|2 to 0	| Modem State |ModemState shows the state of the transmitter and receiver state		|
|		|			  |machines.															|
+-------+-------------+-------------------+-------------------------------------------------+
|		|			  |		  Status	  |					 Description					|
+-------+-------------+-------------------+-------------------------------------------------+
|		|			  |			000	   	  | 					IDLE						|
+-------+-------------+-------------------+-------------------------------------------------+
|		|			  |			001	   	  |Wait for bit StartSend in register  BitFramingReg|
+-------+-------------+-------------------+-------------------------------------------------+
|		|			  |			 	  	  |TxWait: Wait until Rf field is present, if the	|
|		|			  |			010	 	  |bit TxWaitRF is set to logic 1. The minimum time	|
|		|			  |				 	  |for TxWait is defined by the TxWaitReg  register.|
+-------+-------------+-------------------+-------------------------------------------------+
|		|			  |			011	   	  | 				Transmitting					|
+-------+-------------+-------------------+-------------------------------------------------+
|		|			  |				 	  |RxWait: Wait until RF field is present, if the	|
|		|			  |			100		  |bit RxWaitRF  is set to logic 1. The minimum time|
|		|			  |				 	  |for RxWait is defined by the RxWaitReg  register.|
+-------+-------------+-------------------+-------------------------------------------------+
|		|			  |			101	   	  | 				Wait for data					|
+-------+-------------+-------------------+-------------------------------------------------+
|		|			  |			110	   	  | 					Receiving					|
+-------+-------------+-------------------+-------------------------------------------------+
*/
/* In- and output of 64 byte FIFO buffer --------------------------------------*/
#define FIFODataReg							0x09
/*
								Description ofFIFODataReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Data input and output port for the internal 64 byte FIFO buffer. The	|
|7 to 0 | FIFOData |FIFO buffer acts as parallel in/parallel out converter for all serial	|
|		|		   |data stream in- and outputs.											|
+-------+----------+------------------------------------------------------------------------+
*/
/* Indicates the number of bytes stored in the FIFO ---------------------------*/
#define FIFOLevelReg						0x0A
/*
								Description of FIFOLevelReg bits
+-------+-----------+------------------------------------------------------------------------+
|  Bit  |   Symbol  |								Description								 |
