WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Drivers/Ext_Board/inc/stm32f4xx_nucleo_ExtRC522.h
+-------+-----------+------------------------------------------------------------------------+
|		|			|Set to logic 1, this bit clears the internal FIFO-buffer's read- and	 |
|	7	|FlushBuffer|write-pointer and the bit BufferOvfl in the register ErrReg immediately.|
|		|			|Reading this bit will always return 0.									 |
+-------+-----------+------------------------------------------------------------------------+
|6 to 0	| FIFOLevel |Indicates the number of bytes stored in the FIFO buffer. Writing to the |
|		|			|FIFODataReg increments, reading decrements the FIFOLevel.				 |
+-------+-----------+------------------------------------------------------------------------+
*/
/* Defines the level for FIFO under- and overflow warning ---------------------*/
#define WaterLevelReg						0x0B
/* Contains miscellaneous Control Registers -----------------------------------*/
#define ControlReg							0x0C
/*
								Description of ControlReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|	7	| TStopNow |Set to logic 1, the timer stops immediately.							|
|		|		   |Reading this bit will always return 0.									|
+-------+----------+------------------------------------------------------------------------+
|	6	|TStartNow |Set to logic 1 starts the timer immediately.							|
|		|		   |Reading this bit will always return 0.									|
+-------+----------+------------------------------------------------------------------------+
|5 to 3 |	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|2 to 0 |RxLastBits|Shows the number of valid bits in the last received byte. If 0, the		|
|		|		   |whole byte is valid.													|
+-------+----------+------------------------------------------------------------------------+
*/
/* Adjustments for bit oriented frames ----------------------------------------*/
#define BitFramingReg						0x0D
/*
								Description of BitFramingReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|	7	|StartSend |Set to logic 1, the transmission of data starts.						|
|		|		   |This bit is only valid in combination with the Transceive command.		|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Used for reception of bit oriented frames: RxAlign defines the bit		|
|6 to 4 | RxAlign  |position for the first bit received to be stored in the FIFO. Further	|
|		|		   |received bits are stored at the following bit positions.				|
+-------+----------+------------------------------------------------------------------------+
|				   |Example:																|
|				   |RxAlign = 0:  the LSB of the received bit is stored at bit 0, the second|
|				   |received bit is stored at bit position 1.								|
|				   |RxAlign = 1:  the LSB of the received bit is stored at bit 1, the second|
|				   |received bit is stored at bit position 2.								|
|				   |RxAlign = 7:  the LSB of the received bit is stored at bit 7, the second|
|				   |received bit is stored in the following byte at bit position 0.			|
|				   +------------------------------------------------------------------------+
|				   |This bits shall only be used for bitwise anticollision at 106 kbit/s.	|
|				   |In all other modes it shall be set to 0.								|
+-------+----------+------------------------------------------------------------------------+
|	3	|	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Used for transmission of bit oriented frames: TxLastBits defines the	|
|2 to 0 |TxLastBits|number of bits of the last byte that shall be transmitted. A 000b		|
|		|		   |indicates that all bits of the last byte shall be transmitted.			|
+-------+----------+------------------------------------------------------------------------+
*/
/* Bit position of the first bit collision detected on the RF-interface -------*/
#define CollReg								0x0E
/* Reserved for future use ----------------------------------------------------*/
#define RFU0F								0x0F

/*------------------------------ Page1 : Command ------------------------------*/
/* Reserved for future use ----------------------------------------------------*/
#define RFU10								0x10
/* Defines general modes for transmitting and receiving -----------------------*/
#define ModeReg								0x11
/*
								Description of ModeReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, the CRC co-processor calculates the CRC with MSB		|
|	7	| MSBFirst |first and the CRCResultMSB and the CRCResultLSB in the					|
|		|		   |CRCResultReg register are bit reversed.									|
|		|		   |Remark:  During RF communication this bit is ignored.					|
+-------+----------+------------------------------------------------------------------------+
|	6	|	 -     |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|	5	| TxWaitRF |Set to logic 1 the transmitter can only be started, if an RF field is	|
|		|		   |generated.																|
+-------+----------+------------------------------------------------------------------------+
|	4	|	 -     |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|		|		   |PolMFin defines the polarity of the MFIN pin. Set to logic 1, the		|
|		|		   |polarity of MFIN pin is active high. Set to logic 0 the polarity of		|
|	3	| PolMFin  |MFIN pin is active low.													|
|		|		   |Remark: The internal envelope signal is coded active low.				|
|		|		   |		Changing this bit will generate a MFinActIRq event.				|
+-------+----------+------------------------------------------------------------------------+
|	2	|	 -     |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Defines the preset value for the CRC co-processor for the command		|
|		|		   |CalCRC.																	|
|1 to 0 |CRCPreset |Remark: During any communication, the preset values is selected			|
|		|		   |		automatically according to the definition in the bits in		|
|		|		   |		RxModeReg and TxModeReg.										|
+-------+----------+----------------------------+-------------------------------------------+
|				   |			Value			|				Description					|
+------------------+----------------------------+-------------------------------------------+
|				   |			 00				|					0000					|
|				   |			 01				|					6363					|
|				   |			 10				|					A671					|
|				   |			 11				|					FFFF					|
+------------------+----------------------------+-------------------------------------------+
*/
/* Defines the transmission data rate and framing -----------------------------*/
#define TxModeReg							0x12
/*
								Description of TxModeReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, this bit enables the CRC generation during data			|
|	7	| TxCRCEn  |transmission.															|
|		|		   |Remark:  This bit shall only be set to logic 0 at 106 kbit/s.			|
+-------+----------+------------------------------------------------------------------------+
|6 to 4 | TxSpeed  |Defines the bit rate while data transmission. The MFRC522 handels		|
|		|		   |transfer speeds up to 848 kbit/s.										|
+-------+----------+----------------------------+-------------------------------------------+
|				   |			Value			|				Description					|
+------------------+----------------------------+-------------------------------------------+
|				   |			 000			|				106 kbit/s					|
|				   |			 001			|				212 kbit/s					|
|				   |			 010			|				424 kbit/s					|
|				   |			 011			|				848 kbit/s					|
|				   |			 100			|				 Reserved					|
|				   |			 101			|				 Reserved					|
|				   |			 110			|				 Reserved					|
|				   |			 111			|				 Reserved					|
+-------+----------+----------------------------+-------------------------------------------+
|	3	|  InvMod  |Set to logic 1, the modulation for transmitting data is inverted.		|
+-------+----------+------------------------------------------------------------------------+
|2 to 0 |	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
*/
/* Defines the receive data rate and framing ----------------------------------*/
#define RxModeReg							0x13
/*
								Description of RxModeReg bits
+-------+----------+-------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								 |
+-------+----------+-------------------------------------------------------------------------+
|	7	| RxCRCEn  |Set to logic 1, this bit enables the CRC calculation during reception.	 |
|		|		   |Remark:  This bit shall only be set to logic 0 at 106 kbit/s.			 |
+-------+----------+-------------------------------------------------------------------------+
|6 to 4 | RxSpeed  |Defines the bit rate while data receiving. The MFRC522 handles			 |
|		|		   |transfer speeds up to 848kbit/s.										 |
+-------+----------+----------------------------+--------------------------------------------+
|				   |			Value			|				Description					 |
+------------------+----------------------------+--------------------------------------------+
|				   |			 000			|				106 kbit/s					 |
|				   |			 001			|				212 kbit/s					 |
|				   |			 010			|				424 kbit/s					 |
|				   |			 011			|				848 kbit/s					 |
|				   |			 100			|				 Reserved					 |
|				   |			 101			|				 Reserved					 |
|				   |			 110			|				 Reserved					 |
|				   |			 111			|				 Reserved					 |
+-------+----------+----------------------------+--------------------------------------------+
|	3	| RxNoErr  |If set to logic 1, a not valid received data stream (less than 4 bits	 |
|		|		   |received) will be ignored. The receiver will remain active.				 |
+-------+----------+-------------------------------------------------------------------------+
|		|		   |Set to logic 0, the receiver is deactivated after receiving a data frame.|
|		|		   |Set to logic 1, it is possible to receive more than one data frame. This |
|		|		   |bit is only valid for data rates above 106 kbit/s to handle the Polling	 |
|		|		   |command. Having set this bit, the receive and transceive commands will	 |
|	2	|RxMultiple|not terminate automatically. In this case the multiple receiving can only|
|		|		   |be deactivated by writing any command (except the Receive command)		 |
|		|		   |to the CommandReg register or by clearing the bit by the host.			 |
|		|		   |If set to logic 1, at the end of a received data stream an error byte is |
|		|		   |added to the FIFO. The error byte is a copy of the ErrorReg  register.	 |
+-------+----------+-------------------------------------------------------------------------+
|1 to 0 |	 -     |Reserved for future use.												 |
+-------+----------+-------------------------------------------------------------------------+
*/
/* Controls the logical behavior of the antenna driver pins TX1 and TX2 -------*/
#define TxControlReg						0x14
/*
								Description of TxControlReg bits
+-------+-----------+------------------------------------------------------------------------+
|  Bit  |   Symbol  |								Description								 |
+-------+-----------+------------------------------------------------------------------------+
|	7	|InvTx2RFOn	|Set to logic 1, the output signal at pin TX2 will be inverted, if driver|
|		|			|TX2 is enabled.														 |
+-------+-----------+------------------------------------------------------------------------+
|	6	|InvTx1RFOn	|Set to logic 1, the output signal at pin TX1 will be inverted, if driver|
|		|			|TX1 is enabled.														 |
+-------+-----------+------------------------------------------------------------------------+
|	5	|InvTx2RFOff|Set to logic 1, the output signal at pin TX2 will be inverted, if driver|
|		|			|TX2 is disabled.														 |
+-------+-----------+------------------------------------------------------------------------+
|	4	|InvTx1RFOff|Set to logic 1, the output signal at pin TX1 will be inverted, if driver|
|		|			|TX1 is disabled.														 |
+-------+-----------+------------------------------------------------------------------------+
|		|			|Set to logic 1, the output signal on pin TX2 will deliver continuously	 |
|	3	|	Tx2CW	|the un-modulated 13.56 MHz energy carrier.								 |
|		|			|Set to logic 0, Tx2CW is enabled to modulate the 13.56 MHz energy		 |
|		|			|carrier.																 |
+-------+-----------+------------------------------------------------------------------------+
|	2	|	  - 	|Reserved for future use.												 |
+-------+-----------+------------------------------------------------------------------------+
|	1	|  Tx2RFEn  |Set to logic 1, the output signal on pin TX2 will deliver the 13.56 MHz |
|		|			|energy carrier modulated by the transmission data.						 |
+-------+-----------+------------------------------------------------------------------------+
|	0	|  Tx1RFEn  |Set to logic 1, the output signal on pin TX1 will deliver the 13.56 MHz |
|		|			|energy carrier modulated by the transmission data.						 |
+-------+-----------+------------------------------------------------------------------------+
*/
/* Controls the setting of the TX modulation ----------------------------------*/
#define TxASKReg							0x15
/*
								Description of TxAutoReg bits
+-------+-----------+------------------------------------------------------------------------+
|  Bit  |   Symbol  |								Description								 |
+-------+-----------+------------------------------------------------------------------------+
|	7	|	  - 	|Reserved for future use.												 |
+-------+-----------+------------------------------------------------------------------------+
|	6	|Force100ASK|Set to logic 1, Force100ASK forces a 100% ASK modulation				 |
|		|			|independent of the setting in register ModGsPReg.						 |
+-------+-----------+------------------------------------------------------------------------+
|5 to 0 |	  -		|Reserved for future use.												 |
+-------+-----------+------------------------------------------------------------------------+
*/
/* Selects the internal sources for the antenna driver ------------------------*/
#define TxSelReg							0x16
/*
								Description of TxSelReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|7 to 6 |	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|5 to 4 |DriverSel |Selects the input of driver Tx1 and Tx2.								|
+-------+----------+----------------------------+-------------------------------------------+
|				   |			Value			|				 Description 				|
+------------------+----------------------------+-------------------------------------------+
|				   |			 00				|				  Tristate					|
|				   |							|Remark:  In soft power-down the drivers are|
|				   |							|only in tristate mode if DriverSel is set	|
|				   |							|to tristate mode.							|
|				   +----------------------------+-------------------------------------------+
|				   |			 01				|Modulation signal (envelope) from the		|
|				   |							|internal coder, Miller Pulse Coded.		|
|				   +----------------------------+-------------------------------------------+
|				   |			 10				|Modulation signal (envelope) from MIFIN	|
|				   +----------------------------+-------------------------------------------+
|				   |			 11				|					High					|
|				   |							|Remark:  The High level depends on the		|
|				   |							|setting of InvTx1RFOn/ InvTx1RFOff and		|
|				   |							|InvTx2RFOn/ InvTx2RFOff.					|
+-------+----------+----------------------------+-------------------------------------------+
|3 to 0 | MFOutSel |Selects the input for the MFOUT Pin.									|
+-------+----------+----------------------------+-------------------------------------------+
|				   |			Value			|				 Description 				|
+------------------+----------------------------+-------------------------------------------+
|				   |			0000			|				  Tristate  				|
|				   |			0001			|					 Low					|
|				   |			0010			|					High					|
|				   |			0011			|TestBus signal as defined by bit			|
|				   |							|TestBusBitSel in register TestSel1Reg.		|
|				   |			0100			|Modulation signal (envelope) from the		|
|				   |							|internal coder, Miller Puls Coded			|
|				   |			0101			|Serial data stream to be transmitted, data	|
|				   |							|stream before Miller Coder					|
|				   |			0110			|				  Reserved					|
|				   |			0111			|Serial data stream received, data stream	|
|				   |							|after Manchester Decoder					|
|				   |		 1000-1111			|				  Reserved					|
+------------------+----------------------------+-------------------------------------------+
*/
/* Selects internal receiver settings -----------------------------------------*/
#define RxSelReg							0x17
/*
								Description of RxSelReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|7 to 6 | UartSel  |Selects the input of the contactless UART								|
+-------+----------+----------------------------+-------------------------------------------+
|				   |			Value			|				 Description 				|
|				   +----------------------------+-------------------------------------------+
|				   |			  00  			|Constant Low								|
|				   +----------------------------+-------------------------------------------+
|				   |			  01  			|Manchester with sub-carrier from MFIN pin	|
|				   +----------------------------+-------------------------------------------+
|				   |			  10  			|Modulation signal from the internal analog	|
|				   |							|part, default								|
|				   +----------------------------+-------------------------------------------+
|				   |			  11  			|NRZ coding without sub-carrier from MFIN	|
|				   |							|pin. Only valid for transfer speeds above	|
|				   |							|106 kbit/s.								|
+-------+----------+----------------------------+-------------------------------------------+
|		|		   |After data transmission, the activation of the receiver is delayed for	|
|		|		   |RxWait bit-clocks. During this 'frame guard time' any signal at pin Rx	|
|5 to 0 |  RxWait  |is ignored.This parameter is ignored by the receive command.			|
|		|		   |All other commands (e.g. Transceive, MFAuthent) use this parameter.		|
|		|		   |The counter starts immediately after the external RF field is switched	|
|		|		   |on.																		|
+-------+----------+------------------------------------------------------------------------+
*/
/* Selects thresholds for the bit decoder -------------------------------------*/
#define RxThresholdReg						0x18
/*
								Description of RxThresholdReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Defines the minimum signal strength at the decoder input that shall be	|
|7 to 4 | MinLevel |accepted. If the signal strength is below this level, it is not			|
|		|		   |evaluated.																|
+-------+----------+------------------------------------------------------------------------+
|	3	|	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Defines the minimum signal strength at the decoder input that has to be	|
|2 to 0 |CollLevel |reached by the weaker half-bit of the Manchester-coded signal to		|
|		|		   |generate a bit-collision relatively to the amplitude of the stronger	|
|		|		   |half-bit.																|
+-------+----------+------------------------------------------------------------------------+
*/
/* Defines demodulator settings -----------------------------------------------*/
#define DemodReg							0x19
/* Reserved for future use ----------------------------------------------------*/
#define RFU1A								0x1A
/* Reserved for future use ----------------------------------------------------*/
#define RFU1B								0x1B
/* Controls some MIFARE communication transmit parameters ---------------------*/
#define MfTxReg								0x1C
/*
								Description of MifNFCReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|7 to 2 |	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|1 to 0 |  TxWait  |These bits define the additional response time. Per default 7 bits are	|
|		|		   |added to the value of the register bit.									|
+-------+----------+------------------------------------------------------------------------+
*/
/* Controls some MIFARE communication receive parameters ----------------------*/
#define MfRxReg								0x1D
/*
								Description of ManualRCVReg bits
+-------+--------------+--------------------------------------------------------------------+
|  Bit  |    Symbol    |							Description								|
+-------+--------------+--------------------------------------------------------------------+
|7 to 5 |		-	   |Reserved for future use.											|
+-------+--------------+--------------------------------------------------------------------+
|		|			   |If this bit is set to logic 1, the generation of the Parity bit for	|
|	4	|Parity Disable|transmission and the Parity-Check for receiving is switched off. The|
|		|			   |received Parity bit is handled like a data bit.						|
+-------+--------------+--------------------------------------------------------------------+
|3 to 0 |		-	   |Reserved for future use.											|
+-------+--------------+--------------------------------------------------------------------+
*/
/* Reserved for future use ----------------------------------------------------*/
#define RFU1E								0x1E
/* Selects the speed of the serial UART interface -----------------------------*/
#define SerialSpeedReg						0x1F
/*
								Description of SerialSpeedReg bits
