WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Drivers/Ext_Board/inc/stm32f4xx_nucleo_ExtRC522.h
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|7 to 5 |  BR_T0   |Factor BR_T0 to adjust the transfer speed, for description see  Section	|
|		|		   |10.3.2 "Selection of the transfer speeds".								|
+-------+----------+------------------------------------------------------------------------+
|4 to 0 |  BR_T1   |Factor BR_T1 to adjust the transfer speed, for description see  Section	|
|		|		   |10.3.2 "Selection of the transfer speeds".								|
+-------+----------+------------------------------------------------------------------------+
*/

/*-------------------------------- Page2 : CFG --------------------------------*/
/* Reserved for future use ----------------------------------------------------*/
#define RFU20								0x20
/* Shows the actual MSB and LSB values of the CRC calculation -----------------*/
#define CRCResultRegH						0x21
/*
							Description of CRCResultReg higher bits
+-------+------------+-----------------------------------------------------------------------+
|  Bit  |   Symbol   |								Description								 |
+-------+------------+-----------------------------------------------------------------------+
|		|			 |This register shows the actual value of the most significant byte of	 |
|7 to 0 |CRCResultMSB|the CRCResultReg register. It is valid only if bit CRCReady  in		 |
|		|			 |register Status1Reg is set to logic 1.								 |
+-------+------------+-----------------------------------------------------------------------+
*/
/* Shows the actual MSB and LSB values of the CRC calculation -----------------*/
#define CRCResultRegL						0x22
/*
							Description of CRCResultReg lower bits
+-------+------------+-----------------------------------------------------------------------+
|  Bit  |   Symbol   |								Description								 |
+-------+------------+-----------------------------------------------------------------------+
|		|			 |This register shows the actual value of the least significant byte of	 |
|7 to 0 |CRCResultLSB|the CRCResult register. It is valid only if bit CRCReady in register	 |
|		|			 |Status1Reg is set to logic 1.											 |
+-------+------------+-----------------------------------------------------------------------+
*/
/* Reserved for future use ----------------------------------------------------*/
#define RFU23								0x23
/* Controls the setting of the ModWidth ---------------------------------------*/
#define ModWidthReg							0x24
/*
								Description of ModWidthReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |These bits define the width of the Miller modulation as multiples of the|
|7 to 0 | ModWidth |carrier frequency (ModWidth +1/fc). The maximum value is half the bit	|
|		|		   |period.																	|
+-------+----------+------------------------------------------------------------------------+
*/
/* Reserved for future use ----------------------------------------------------*/
#define RFU25								0x25
/* Configures the receiver gain -----------------------------------------------*/
#define RFCfgReg							0x26
/*
								Description of RFCfgReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|	7	|	 -     |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
|6 to 4 |  RxGain  |This register defines the receivers signal voltage gain factor:			|
+-------+----------+----------------------------+-------------------------------------------+
|				   |			Value			|				  Description  				|
+------------------+----------------------------+-------------------------------------------+
|				   |			 000			|					 18 dB					|
|				   |			 001			|					 23 dB					|
|				   |			 010			|					 18 dB					|
|				   |			 011			|					 23 dB					|
|				   |			 100			|					 33 dB					|
|				   |			 101			|					 38 dB					|
|				   |			 110			|					 43 dB					|
|				   |			 111			|					 48 dB					|
+-------+----------+----------------------------+-------------------------------------------+
|3 to 0 |	 -	   |Reserved for future use.												|
+-------+----------+------------------------------------------------------------------------+
*/
/* Selects the conductance of the antenna driver pins TX1 and TX2 for modulation */
#define GsNReg								0x27
/* ----------------------------------------------------------------------------*/
#define CWGsPReg							0x28
/* ----------------------------------------------------------------------------*/
#define ModGsPReg							0x29
/* Defines settings for the internal timer ------------------------------------*/
#define TModeReg							0x2A
/*
								Description of TModeReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|		|		   |Set to logic 1, the timer starts automatically at the end of the		|
|		|		   |transmission in all communication modes at all speeds. The timer stops	|
|		|		   |immediately after receiving the first data bit if the bit RxMultiple in	|
|		|		   |the register RxModeReg is not set.										|
|	7	|	TAuto  |If RxMultiple is set to logic 1, the timer never stops. In this case the|
|		|		   |timer can be stopped by setting the bit TStopNow in register  ControlReg|
|		|		   |to logic 1.																|
|		|		   |Set to logic 0 indicates, that the timer is not influenced by the		|
|		|		   |protocol.																|
+-------+----------+------------------------------------------------------------------------+
|		|		   |The internal timer is running in gated mode.							|
|6 to 5 |  TGated  |Remark: In the gated mode, the bit TRunning is logic 1 when the timer	|
|		|		   |		is enabled by the register bits. This bit does not influence the|
|		|		   |		gating signal.													|
+-------+----------+----------------------------+-------------------------------------------+
|				   |			Value			|				  Description  				|
+------------------+----------------------------+-------------------------------------------+
|				   |			 00				|				Non gated mode				|
|				   |			 01				|				 Gated by MFIN				|
|				   |			 10				|				 Gated by AUX1				|
|				   |			 11				|				  Gated by A3				|
+-------+----------+-+--------------------------+-------------------------------------------+
|		|			 |Set to logic 1, the timer automatically restart its count-down from	|
|	4	|TAutoRestart|TReloadValue, instead of counting down to zero.						|
|		|			 |Set to logic 0 the timer decrements to 0 and the bit TimerIRq is set	|
|		|			 |to logic 1.															|
+-------+------------++---------------------------------------------------------------------+
|		|			  |Defines higher 4 bits for TPrescaler.								|
|3 to 0 |TPrescaler_Hi|The following formula is used to calculate fTimer:					|
|		|			  |		fTimer = 6.78 MHz/TPreScaler.									|
|		|			  |For detailed description see Section 13 "Timer Unit".				|
+-------+-------------+---------------------------------------------------------------------+
*/
/* ----------------------------------------------------------------------------*/
#define TPrescalerReg						0x2B
/*
								Description of TPrescalerReg bits
+-------+-------------+---------------------------------------------------------------------+
|  Bit  |   Symbol    |								Description								|
+-------+-------------+---------------------------------------------------------------------+
|		|			  |Defines lower 8 bits for TPrescaler.									|
|7 to 0 |TPrescaler_Lo|The following formula is used to calculate fTimer:					|
|		|			  |		fTimer = 6.78 MHz/TPreScaler.									|
|		|			  |For detailed description see Section 13 "Timer Unit".				|
+-------+-------------+---------------------------------------------------------------------+
*/
/* Describes the 16 bit timer reload value ------------------------------------*/
#define TReloadRegH							0x2C
/*
								Description of higher TReloadReg bits
+-------+-------------+---------------------------------------------------------------------+
|  Bit  |   Symbol    |								Description								|
+-------+-------------+---------------------------------------------------------------------+
|		|			  |Defines the higher 8 bits for the TReloadReg.						|
|7 to 0 |TReloadVal_Hi|With a start event the timer loads the TReloadVal. Changing this		|
|		|			  |register affects the timer only at the next start event.				|
+-------+-------------+---------------------------------------------------------------------+
*/
/* Describes the 16 bit timer reload value ------------------------------------*/
#define TReloadRegL							0x2D
/*
								Description of lower TReloadReg bits
+-------+-------------+---------------------------------------------------------------------+
|  Bit  |   Symbol    |								Description								|
+-------+-------------+---------------------------------------------------------------------+
|		|			  |Defines the lower 8 bits for the TReloadReg.							|
|7 to 0 |TReloadVal_Lo|With a start event the timer loads the TReloadVal. Changing this		|
|		|			  |register affects the timer only at the next start event.				|
+-------+-------------+---------------------------------------------------------------------+
*/
/* Shows the 16 bit actual timer value ----------------------------------------*/
#define TCounterValRegH						0x2E
/*
								Description of higher TCounterValReg bits
+-------+--------------+--------------------------------------------------------------------+
|  Bit  |    Symbol    |							Description								|
+-------+--------------+--------------------------------------------------------------------+
|7 to 0 |TCounterVal_Hi|Current value of the timer, higher 8 bits.							|
+-------+--------------+--------------------------------------------------------------------+
*/
/* Shows the 16 bit actual timer value ----------------------------------------*/
#define TCounterValRegL						0x2F
/*
								Description of lower TCounterValReg bits
+-------+--------------+--------------------------------------------------------------------+
|  Bit  |    Symbol    |							Description								|
+-------+--------------+--------------------------------------------------------------------+
|7 to 0 |TCounterVal_Lo|Current value of the timer, lower 8 bits.							|
+-------+--------------+--------------------------------------------------------------------+
*/

