WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Drivers/Ext_Board/inc/stm32f4xx_nucleo_ExtRC522.h
/*--------------------------- Page3 : TestRegister ----------------------------*/
/* Reserved for future use ----------------------------------------------------*/
#define RFU30								0x30
/* General test signal configuration ------------------------------------------*/
#define TestSel1Reg							0x31
/* General test signal configuration and PRBS control -------------------------*/
#define TestSel2Reg							0x32
/* Enables pin output driver on D1 - D7 ---------------------------------------*/
#define TestPinEnReg						0x33
/* Defines the values for D1 - D7 when it is used as I/O bus ------------------*/
#define TestPinValueReg						0x34
/* Shows the status of the internal testbus -----------------------------------*/
#define TestBusReg							0x35
/* Controls the digital selftest ----------------------------------------------*/
#define AutoTestReg							0x36
/* Shows the version ----------------------------------------------------------*/
#define VersionReg							0x37
/*
								Description of VersionReg bits
+-------+----------+------------------------------------------------------------------------+
|  Bit  |  Symbol  |								Description								|
+-------+----------+------------------------------------------------------------------------+
|7 to 0 | Version  |Indicates current version.												|
|		|		   |Remark: The current version for MFRC522 is 90h or 91h.					|
+-------+----------+------------------------------------------------------------------------+
*/
/* Controls the pins AUX1 and AUX2 --------------------------------------------*/
#define AnalogTestReg						0x38
/* Defines the test value for the TestDAC1 ------------------------------------*/
#define TestDAC1Reg							0x39
/* Defines the test value for the TestDAC2 ------------------------------------*/
#define TestDAC2Reg							0x3A
/* Shows the actual value of ADC I and Q --------------------------------------*/
#define TestADCReg							0x3B
/* Reserved for future use ----------------------------------------------------*/
#define RFU3C								0x3C
/* Reserved for future use ----------------------------------------------------*/
#define RFU3D								0x3D
/* Reserved for future use ----------------------------------------------------*/
#define RFU3E								0x3E
/* Reserved for future use ----------------------------------------------------*/
#define RFU3F								0x3F

/*******************************************************************************/
/**************************** END REGISTER MAPPING *****************************/
/*******************************************************************************/

/* TModeReg->TAuto */
#define TAutoMode_On						(1<<7)
#define TAutoMode_Off						(0<<7)

/* TxASKReg->Force100ASK */
#define Force100ASK							(1<<6)
#define NoForce								(0<<6)

/* ModeReg->CRCPreset */
#define CRCPreset_0000						(0x00)
#define CRCPreset_6363						(0x01)
#define CRCPreset_A671						(0x02)
#define CRCPreset_FFFF						(0x03)

/* Exported FunctionPrototypes -----------------------------------------------*/
void MFRC522_Init(MFRC522_InitTypeDef *MFRC522_InitStruct);
void MFRC522_Reset(void);
void Set_Antenna_On(void);
void Set_Antenna_Off(void);
uint8_t MFRC522_RequestCard(uint8_t ReqMode, uint8_t *TagType);
uint8_t MFRC522_Anti_Coll_Detec(uint8_t *pSerNum);
uint8_t MFRC522_SelectTag(uint8_t *pSerNum);
uint8_t MFRC522_Auth(uint8_t AuthMode, uint8_t BlockAddr, uint8_t *SectorKey, uint8_t *pSerNum);
uint8_t MFRC522_TX_Packet(uint8_t BlockAddr, uint8_t *pBuffer);
uint8_t MFRC522_RX_Packet(uint8_t BlockAddr, uint8_t *pBuffer);
void MFRC522_EnterHalt(void);
uint8_t CommunicateWithIC(uint8_t Command, uint8_t *pTransData, uint8_t TransLen, uint8_t *pReceiData, uint16_t *ReceiLen);
uint8_t MFRC522_SPI_RW_Reg(uint8_t Reg, uint8_t Value);
uint8_t MFRC522_SPI_Read_Reg(uint8_t Reg);
#ifdef USE_DEFAULT_TIMEOUT_CALLBACK
uint32_t MFRC522_TIMEOUT_UserCallback(void);
#endif /* USE_DEFAULT_TIMEOUT_CALLBACK */

#ifdef __cplusplus
 }
#endif

#endif /* __STM32F4XX_NUCLEO_EXTRC522_H */

/*************************************** END OF FILE ***************************************/
